---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.MEPHiddenLineSettings.OutsideGap
source: html/d5a7eadf-7388-1251-7c58-778cd5a3add6.htm
---
# Autodesk.Revit.DB.Mechanical.MEPHiddenLineSettings.OutsideGap Property

The gap for the lines that appear external to the crossing segments.

## Syntax (C#)
```csharp
public double OutsideGap { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The gap size must be between 0" and 3/4".